Revit 2024 API
FailureDefinitionAccessor.GetApplicableResolutionTypes Method
 Retrieves a list of resolution types applicable to the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public IList<FailureResolutionType> GetApplicableResolutionTypes()
Visual Basic
Public Function GetApplicableResolutionTypes As IList(Of FailureResolutionType)
Visual C++
public:
IList<FailureResolutionType>^ GetApplicableResolutionTypes()
Return Value
 The list of resolution types applicable to the failure.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized.
See Also
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace